# Demo of CachePython Module - Cache Queries

In [1]:
from CachePython import CacheQuery

ModuleNotFoundError: No module named 'CachePython'

## Create a CacheInstance object

In [2]:
samples_query = CacheQuery(namespace='SAMPLES', username='_SYSTEM', password='SYS', dl=99)
samples_query

CachePython Module :
Enhanced OOP porting of Intersystems Cache python binding modules
(C) 2017 HEALIS.EU - Athanassios I. Hatzis, All Rights Reserved

CACHE Connection object to  SAMPLES  is created successfully.
CACHE Connection Implementation Version :  1.0.1
CACHE Database object is created successfully
CACHE Query object created successfully

CacheQuery(localhost, 1972, _SYSTEM, SYS, SAMPLES, Sample, Person)

In [3]:
print(samples_query)

CacheQuery(host='localhost', port=1972, username='_SYSTEM', password='SYS', namespace='SAMPLES', cachepackage='Sample', cacheclass='Person')

In [4]:
print(samples_query.private_attributes)

CACHE_Query      : <class 'intersys.pythonbind3.query'>
CACHE_Database   : <class 'intersys.pythonbind3.database'>
CACHE_Connection : <class 'intersys.pythonbind3.connection'>

## Execute SQL query by passing an SQL string

In [5]:
samples_query.execute_sql('SELECT ID, Name, DOB, SSN FROM Sample.Person')

result set is now ready and can be fetched

### get the header of the result set

In [6]:
samples_query.columns

['ID', 'Name', 'DOB', 'SSN']

### query result set is a generator object

In [7]:
samples_query.result_set

###  count the total number of records in the result set

In [8]:
samples_query.count_records()

200

### re-execute query

In [9]:
samples_query.execute_sql('SELECT ID, Name, DOB, SSN FROM Sample.Person')

result set is now ready and can be fetched

### print records

In [10]:
samples_query.print_records(40)

Iter: 0, Cnt: 1 - Element: [1, 'Isaksen,Alexandra T.', 1932-08-23, '207-26-6677']
Iter: 1, Cnt: 2 - Element: [2, 'Isaacs,Emily R.', 1930-10-31, '295-77-6690']
Iter: 2, Cnt: 3 - Element: [3, 'Feynman,James K.', 1968-07-21, '928-52-1962']
Iter: 3, Cnt: 4 - Element: [4, 'Vanzetti,Mary R.', 2014-06-14, '234-96-2703']
Iter: 4, Cnt: 5 - Element: [5, 'Orwell,Alfred R.', 1986-04-13, '422-27-1069']
Iter: 5, Cnt: 6 - Element: [6, 'Ironhorse,Stuart F.', 1930-05-27, '597-44-6996']
Iter: 6, Cnt: 7 - Element: [7, 'Browning,Mary C.', 1927-04-25, '692-44-7227']
Iter: 7, Cnt: 8 - Element: [8, 'Jones,David S.', 1965-02-11, '269-67-6145']
Iter: 8, Cnt: 9 - Element: [9, 'Xavier,Dan K.', 1949-06-29, '335-82-9284']
Iter: 9, Cnt: 10 - Element: [10, 'Goncharuk,Greta W.', 1966-06-02, '134-52-9380']
Iter: 10, Cnt: 11 - Element: [11, 'Yang,Angela V.', 1983-09-24, '913-73-2957']
Iter: 11, Cnt: 12 - Element: [12, 'Palmer,Jules O.', 1988-05-30, '372-68-7006']
Iter: 12, Cnt: 13 - Element: [13, 'Vonnegut,Danielle U.', 1947-07-26, '437-26-4645']
Iter: 13, Cnt: 14 - Element: [14, "O'Brien,Linda Y.", 1995-11-21, '147-87-7303']
Iter: 14, Cnt: 15 - Element: [15, 'Vanzetti,Sally C.', 1985-08-27, '232-39-2188']
Iter: 15, Cnt: 16 - Element: [16, 'Wells,Wolfgang H.', 2004-12-30, '504-94-2516']
Iter: 16, Cnt: 17 - Element: [17, 'Underman,Angela S.', 2016-06-16, '699-25-7087']
Iter: 17, Cnt: 18 - Element: [18, 'Tweed,Alvin A.', 1964-07-16, '657-51-8721']
Iter: 18, Cnt: 19 - Element: [19, 'Clay,Joe N.', 1988-05-18, '609-96-5473']
Iter: 19, Cnt: 20 - Element: [20, 'Ragon,Valery O.', 1970-10-13, '527-28-3379']
Iter: 20, Cnt: 21 - Element: [21, 'Munt,Peter N.', 2014-09-15, '590-44-1966']
Iter: 21, Cnt: 22 - Element: [22, 'Long,Amanda M.', 1930-12-24, '875-21-6177']
Iter: 22, Cnt: 23 - Element: [23, 'Klausner,Charles U.', 1952-04-03, '648-59-2250']
Iter: 23, Cnt: 24 - Element: [24, 'Zemaitis,Howard L.', 1956-01-21, '781-50-2402']
Iter: 24, Cnt: 25 - Element: [25, 'Schulte,Peter L.', 1929-06-19, '188-31-3016']
Iter: 25, Cnt: 26 - Element: [26, 'Vonnegut,Jose G.', 1980-01-05, '282-12-9112']
Iter: 26, Cnt: 27 - Element: [27, 'Chadbourne,Alfred O.', 1945-10-02, '222-42-3170']
Iter: 27, Cnt: 28 - Element: [28, 'Levinson,Zoe O.', 1992-08-03, '864-94-2172']
Iter: 28, Cnt: 29 - Element: [29, 'Bush,Uma S.', 2005-05-01, '302-57-9782']
Iter: 29, Cnt: 30 - Element: [30, 'Clinton,Pat P.', 1927-06-02, '624-69-2315']
Iter: 30, Cnt: 31 - Element: [31, 'Feynman,Dick K.', 1957-09-10, '328-54-8658']
Iter: 31, Cnt: 32 - Element: [32, 'Xavier,Janice G.', 2000-03-20, '525-76-8476']
Iter: 32, Cnt: 33 - Element: [33, 'Cerri,Sally E.', 1978-12-24, '633-17-6400']
Iter: 33, Cnt: 34 - Element: [34, 'Johnson,Chris U.', 1947-06-23, '503-60-3800']
Iter: 34, Cnt: 35 - Element: [35, 'Eastman,Frances U.', 1961-04-05, '155-60-2820']
Iter: 35, Cnt: 36 - Element: [36, 'Yezek,Rhonda J.', 1948-06-17, '578-26-1788']
Iter: 36, Cnt: 37 - Element: [37, 'Tsatsulin,Dan R.', 1974-12-17, '768-70-1581']
Iter: 37, Cnt: 38 - Element: [38, 'Orlin,Rhonda M.', 1925-07-23, '482-36-6223']
Iter: 38, Cnt: 39 - Element: [39, 'Newton,Barbara M.', 1974-01-21, '581-24-3221']
Iter: 39, Cnt: 40 - Element: [40, 'Hertz,Gertrude N.', 1960-01-29, '741-59-7518']

### display records in a pandas dataframe

In [11]:
samples_query.display_records(50)

    ID                  Name         DOB          SSN
0   41  Ravazzolo,Charles X.  1953-07-16  924-20-1182
1   42     Diavolo,Angela K.  1955-08-04  763-59-8356
2   43          Drabek,Mo Q.  1961-10-21  538-94-9875
3   44        Umansky,Uma T.  1926-10-20  896-41-7906
4   45          Finn,Buzz D.  1952-02-03  210-10-9763
5   46       Zevon,Edward C.  1996-06-03  661-45-8189
6   47       Koenig,Clint H.  2013-09-19  642-38-5020
7   48   Hernandez,Rhonda F.  1979-04-26  658-17-2445
8   49     Donaldson,Emma W.  1928-12-28  689-96-9927
9   50    Tweed,Alexandra Q.  2013-02-07  134-86-7366
10  51     Leiberman,Emma L.  1953-08-21  791-95-1082
11  52    Burroughs,Keith C.  1955-02-17  305-17-9685
12  53       Olsen,Robert B.  1967-07-03  918-81-2873
13  54     Hammel,Quentin F.  1957-02-06  223-47-6264
14  55      Ramsay,Sophia I.  1977-02-15  650-96-7289
15  56         Ragon,Jose U.  1986-10-18  585-74-1584
16  57        Gold,Violet T.  1969-08-01  387-37-6873
17  58     DeSantis,Wilma L.  1924-08-02  894-30-3393
18  59    Ingrahm,Kirsten P.  1979-12-19  545-28-1959
19  60    Chesire,Michael Y.  1984-07-25  402-51-9716
20  61   Martinez,Barbara J.  2014-06-06  855-88-4267
21  62   O'Donnell,Brenda B.  2006-01-17  623-88-2338
22  63       Gallant,Will U.  1978-12-19  464-47-4969
23  64    Clinton,Stavros O.  1963-06-07  647-77-3381
24  65        Braam,Alvin F.  1959-05-21  809-44-6154
25  66   Ingersol,Richard U.  1932-05-06  851-98-3939
26  67      Diavolo,Jules G.  1933-11-30  436-53-3895
27  68     Uberoth,Stuart F.  2010-10-25  308-93-8200
28  69        Black,Agnes O.  2013-04-11  324-78-7237
29  70    Malynko,Michael P.  1962-09-18  883-98-3863
30  71           Ott,Barb Y.  2011-03-18  742-20-3937
31  72     Ihringer,Wilma T.  1925-08-02  601-84-2423
32  73    Isaksen,Michael U.  1972-07-28  566-84-6943
33  74   Lennon,Christine X.  1970-08-25  187-78-5009
34  75      Feynman,Orson K.  1948-07-29  694-31-7101
35  76       Peters,Maria X.  1934-01-28  594-87-7564
36  77        Edison,Barb K.  1941-03-14  749-16-9953
37  78   Tsatsulin,Nellie A.  1969-10-21  317-74-3023
38  79      Adams,Stavros X.  1968-12-09  250-79-7429
39  80         Page,Laura Y.  1986-12-02  735-16-5768
40  81         Hills,Phil P.  1963-11-15  931-11-2763
41  82     Harrison,Greta U.  1965-01-26  627-70-2668
42  83      Smyth,Jocelyn Z.  1940-03-06  151-49-8012
43  84      Feynman,Zelda F.  2005-04-16  207-63-9461
44  85      Pantaleo,Bart N.  1989-11-02  784-84-8844
45  86       Townsend,Pam W.  2003-10-17  874-68-6763
46  87     Evans,Nataliya W.  1950-02-15  290-61-8250
47  88         Klein,Liza O.  1958-10-16  538-72-5937
48  89   Semmens,Filomena P.  1961-01-16  366-83-4774
49  90       Winters,Jane V.  1971-03-23  536-27-5329

### skip records

In [12]:
samples_query.skip_records(20)

samples_query.display_records(10)

    ID                 Name         DOB          SSN
0  111  Xander,Christine Q.  1991-03-15  629-14-6409
1  112      Perez,Nellie P.  1960-01-06  230-60-6205
2  113   Nichols,Vincent X.  1977-04-25  390-76-9829
3  114        King,Terry Q.  1924-01-19  484-96-8493
4  115        Jung,Terry G.  1932-08-15  939-47-9874
5  116         Evans,Pat J.  1997-12-07  368-93-4336
6  117      Cheng,Imelda H.  2004-11-06  866-36-5045
7  118      Tillem,Maria X.  1941-06-13  715-31-6735
8  119  Ingersol,Vincent O.  1947-06-14  867-48-2437
9  120     Rodriguez,Sam U.  2009-03-05  145-75-1244

## Execute Call to a CACHE Class Query

In [13]:
samples_query.execute_call('Person', 'Extent')

result set is now ready and can be fetched

In [14]:
samples_query.display_records(10)

   ID                  Name          SSN   Home.City Home.State
0   1  Isaksen,Alexandra T.  207-26-6677  Queensbury         LA
1   2       Isaacs,Emily R.  295-77-6690  Gansevoort         SD
2   3      Feynman,James K.  928-52-1962   Larchmont         CO
3   4      Vanzetti,Mary R.  234-96-2703  Zanesville         MS
4   5      Orwell,Alfred R.  422-27-1069       Ukiah         OH
5   6   Ironhorse,Stuart F.  597-44-6996       Islip         NE
6   7      Browning,Mary C.  692-44-7227  Zanesville         NC
7   8        Jones,David S.  269-67-6145      Pueblo         OH
8   9         Xavier,Dan K.  335-82-9284      Newton         ND
9  10    Goncharuk,Greta W.  134-52-9380      Reston         SC

## Execute the same query invoking the stored procedure with CALL

In [15]:
samples_query.execute_sql("CALL Sample.Person_Extent")
samples_query.display_records(5)

result set is now ready and can be fetched

  ID                  Name          SSN   Home.City Home.State
0  1  Isaksen,Alexandra T.  207-26-6677  Queensbury         LA
1  2       Isaacs,Emily R.  295-77-6690  Gansevoort         SD
2  3      Feynman,James K.  928-52-1962   Larchmont         CO
3  4      Vanzetti,Mary R.  234-96-2703  Zanesville         MS
4  5      Orwell,Alfred R.  422-27-1069       Ukiah         OH

## Execute Call to a CACHE Class Query with parameter

In [16]:
samples_query.execute_call('Person', 'ByName', 'A')
samples_query.display_records(5)

result set is now ready and can be fetched
Execution reached the end of the result set

    ID              Name         DOB          SSN
0  175      Adam,Lisa H.  1927-10-09  252-98-5363
1  154     Adams,Liza Z.  1996-10-01  473-63-1193
2   79  Adams,Stavros X.  1968-12-09  250-79-7429
3  123  Alton,Frances S.  1946-07-30  956-58-1061

## Execute SQL SELECT query with a single parameter

In [17]:
sqlstr = "SELECT ID, Name, DOB, SSN \
               FROM SAMPLE.PERSON \
               WHERE Name %STARTSWITH ?"

samples_query.execute_sql(sqlstr,'A')
samples_query.display_records(5)

result set is now ready and can be fetched
Execution reached the end of the result set

    ID              Name         DOB          SSN
0   79  Adams,Stavros X.  1968-12-09  250-79-7429
1  123  Alton,Frances S.  1946-07-30  956-58-1061
2  154     Adams,Liza Z.  1996-10-01  473-63-1193
3  175      Adam,Lisa H.  1927-10-09  252-98-5363